<html>
    <head>
        <meta charset="utf-8">
		<meta name="description" content="Java, JavaScript, их особенности и возможности">
		<meta name="keywords" content="Java, JS">
		<meta name="viewport" content="width=device-width, initial-scale=1.0">
        <title>Java, JS</title>
		<link rel="stylesheet" href="stelee.css">
		<meta name="robots" content="index, follow">
    </head>
	<body>
<div style="width: 58%; height:100px; position:relative; left:21%; ">
	<div class="menu">

	<div class="logo">
	<img src="logo.png"  width="100" href="vh.html?do=logout" height="100" class="krugi" alt="logo" align="left"/>
</div>
	<div class="knopki" align="center" >
	<ul id="navbar">
	<li><a href="index.php"><h3>Главная</h3></a></li>
   <li><a href="chasha.php"><h3>Python</h3></a>

   <li><a href="vid.php"><h3>Java, JS</h3></a>

   <li><a href="kal.php"><h3>Golang </h3></a>
   
  <li><a href="tabak.php"><h3>Kotlin</h3></a>

		</ul>
</div>
</div>
<br><br><br><br><br><br>
<h1>Java</h1>
<img src="foto44.jpeg"  width="250" href="vh.html?do=logout" height="250" class="krugi" alt="Java" align="left"/>
<p>
<b>Java</b> – кроссплатформенный объектно-ориентированный язык программирования. Он не теряет своей популярности с момента появления и является основой многих веб-сервисов и Android-приложений.
 Особенно язык популярен у крупных корпораций, где требуется создание высоконагруженных систем, например, в корпоративном ПО. Однако,
 в мобильной разработке Java начинает уступать более современному Kotlin.
<br><br>
<b>Где используют:</b> почти везде: программы, десктопные приложения, веб-приложения и сервера, приложения под Android можно написать на Java.
 Проблемы есть с играми – особенности языка не позволяют сделать необходимую оптимизацию под процессор и видеокарту.
<br><br>
<b>Особенности:</b> Java компилируется не совсем обычным способом – сначала код преобразуется в специальный байт-код, а затем выполняется JVM (Java Virtual Machine).
 Эта особенность делает Java кроссплатформенным языком – программист пишет под JVM, которая дальше адаптирует код под нужную платформу.<br><br>
</p>
<hr>
<h1>JavaScript </h1>
<img src="foto55.jpg"  width="250" href="vh.html?do=logout" height="250" class="krugi" alt="JS" align="right"/>
<p>
Язык, который редко выходит из топ-5. <b> JavaScript</b> “оживляет” веб-страницы и является неповторимым для фронтенда в веб-разработке. Все, что сегодня мы видим на странице или, по-другому, на “клиентской стороне” – это JS. Название, к слову, единственное что объединяет этот язык с Java – на заре создания создатели решили таким образом “урвать” небольшой кусочек славы гиганта со схожим названием.

Изначально JavaScript обладал скромными возможностями – с его помощью могли добавить лишь немного кнопок на страницу. Создание модуля Node.js расширило горизонты языка. Однако, веб-страницы остаются его главной “мощью”, только теперь с сильно прокаченным функционалом.
<br><br>
<b>Где используют:</b> веб-страницы, веб-приложения, мобильная разработка, программирование “умных” устройств. Например, Notion или Discord написаны на JS.
<br><br>
<b>Возможности:</b> сегодня JavaScript можно использовать как на клиентской, так и на серверной стороне. Это стало доступно благодаря модулю Node.js, 
который способен работать с базами данных и обрабатывать запросы к серверу. А различные фреймворки расширяют возможности JS. Например React Native, 
который позволяет писать десктопные приложения. Или Electron, 
объединяющий в себе технологии HTML, CSS и JS и позволяющая создавать кроссплатформенные приложения для настольных операционных систем.
</p>
<br>
</body>
</html>